ibpasha1/QuranNode/firmware/sdkconfig.defaults
# QuranNode firmware — ESP32-S3-WROOM-1-N16R8 (16MB flash, 8MB octal PSRAM).
CONFIG_IDF_TARGET="esp32s3"

# Flash + partitions
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a new image boots in "pending verify"; main.c calls
# ota_mark_valid() once the HAL is up. If it never does (crash/boot loop), the
# bootloader reverts to the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# HTTPS pull-update from GitHub Releases needs the Mozilla CA bundle for TLS.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Octal PSRAM (holds the 480x320 framebuffers + double buffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# Runtime. Big main-task stack: the app loop runs Arabic rendering AND the
# on-demand MP3 decode (minimp3) on this task, which the default 8KB can't hold.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# FAT long filenames (library tracks have spaces / long names)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
